/*
13. В кассе хранится информация о поездах на ближайшую неделю: 
- дата выезда, 
- пункт назначения, 
- время отправления, 
- число свободных мест. 
Необходимо зарезервировать m мест до города N на k-й день недели с временем отправления поезда не позднее t часов. 
Вывести время отправления или сообщение о невозможности выполнить заказ. Ключ: число свободных мест.
*/
#include <iostream>

using namespace std;

struct train {

};

int main() {
    cout << "Hello World!\n";
}
