/* На основании задания, размещенного в п. 3.3.2, написать программу рас-
чета выбранной функции Y(x), S(x) или |Y(x) – S(x)|, вид которой, в свою оче-
редь, передается в качестве параметра в функцию вывода (Out_Rez).*/
#include <iostream>

int main() {

    std::cout << "Hello World!\n";
}
